// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
// 2016.01.17
// 23:03:57
// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#include "App.h"




/*------------------------------------------------------------------------------
 Подготовка ADC к работе

 ------------------------------------------------------------------------------*/
void ADC_prepere(void)
{
  // Назначаем источник запускабщих сигналов для ADC
  // Это будет PIT0 канал 0
  SIM_SOPT |= LSHIFT(1, 8);
}
/*------------------------------------------------------------------------------
   Обработчик прерываний от ADC

 ------------------------------------------------------------------------------*/
void ADC_Isr(void)
{

  VAN_adcr = ADC_R;
  VOLTAGE_adcr = ADC_R;
  TEMPER_adcr = ADC_R;
  INTTEMPER_adcr = ADC_R;
  Display_scaning();

}
