// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
// 2016.01.24
// 11:11:07
// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#include   "app.h"


/*------------------------------------------------------------------------------
 Получить температу от внутреннего датчика в формате с плавающей точкой

 \return float
 ------------------------------------------------------------------------------*/
float Get_internal_temperature(void)
{
  float  f;

  // приводим значение взятого отсчета АЦП к напряжению с типом float
  if (INTTEMPER_adcr > T25SMPL)
  {
    //  Ниже 25 С
    f = 25 - (INTTEMPER_adcr - T25SMPL) / (1000.0 * TSLOPE_LOW);
  }
  else
  {
    // Выше 25 С
    f = (T25SMPL - INTTEMPER_adcr) / (1000.0 * TSLOPE_HIGH) + 25;
  }

  return f;
}

/*------------------------------------------------------------------------------
 Получить напряжение питания в формате с плавающей точкой

 \return float
 ------------------------------------------------------------------------------*/
float Get_power_voltage(void)
{
  float  f;

  f = (VOLTAGE_adcr * 112.0) / (12 * 1000.0);
  return f;
}
